{
    "Readme Template": {
        "prefix": "dreadme",
        "body": [
            "# Project Title",
            "",
            "Briefly describe your project here.",
            "",
            "## Table of Contents",
            "",
            "- [Project Title](#project-title)",
            "  - [Table of Contents](#table-of-contents)",
            "  - [Introduction](#introduction)",
            "  - [Features](#features)",
            "  - [Getting Started](#getting-started)",
            "    - [Prerequisites](#prerequisites)",
            "    - [Installation](#installation)",
            "  - [Usage](#usage)",
            "  - [Contributing](#contributing)",
            "  - [License](#license)",
            "  - [Acknowledgments](#acknowledgments)",
            "",
            "## Introduction",
            "",
            "Provide an introduction to your project. Explain what it does, why it's useful, and who the target audience is. You can also include a high-level overview of its features.",
            "",
            "## Features",
            "",
            "List the key features of your project. Use bullet points for clarity.",
            "",
            "- Feature 1",
            "- Feature 2",
            "- ...",
            "",
            "## Getting Started",
            "",
            "Provide instructions on how to get started with your project. This section should cover prerequisites and installation steps.",
            "",
            "### Prerequisites",
            "",
            "List any software or tools that users need to install before they can use your project.",
            "",
            "- Prerequisite 1",
            "- Prerequisite 2",
            "- ...",
            "",
            "### Installation",
            "",
            "Provide step-by-step instructions on how to install and set up your project.",
            "",
            "1. Step 1",
            "2. Step 2",
            "3. ...",
            "",
            "## Usage",
            "",
            "Explain how to use your project. Include code examples, if applicable.",
            "",
            "## Contributing",
            "",
            "Provide guidelines for others who may want to contribute to your project. Include information on how to submit bug reports, feature requests, or pull requests.",
            "",
            "## Feedback",
            "Provide github link for feedback",
            "",
            "## License",
            "",
            "Specify the license for your project and include any licensing-related information.",
            "",
            "## Acknowledgments",
            "",
            "Give credit to any individuals or projects that inspired or assisted your work.",
            "",
            "- Acknowledgment 1",
            "- Acknowledgment 2",
            "- ...",
            "",
            "## Contact",
            "",
            "Provide contact information or links to your social media profiles, website, or email address for users who want to reach out or learn more about you.",
            "",
            "---",
            "",
            "**Note**: You can remove or expand sections based on your project's specific requirements. Be sure to replace the placeholders with your actual content."
        ],
        "description": "Make a basic Readme template"
    }
}